TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        // Store version string in badge's user_data so the callback can show it
        static char versionBuf[24];
        strncpy(versionBuf, version, sizeof(versionBuf) - 1);
        lv_obj_set_user_data(_otaBadge, versionBuf);
        lv_obj_add_event_cb(_otaBadge, onOtaBadgeTapped, LV_EVENT_CLICKED, this);
    }

    void clearOtaBadge() {
        if (_otaBadge) { lv_obj_del(_otaBadge); _otaBadge = nullptr; }
    }

    // Set this before begin(). Called when user confirms "Install".
    std::function<void()> onOtaInstallConfirmed;

    bool miningFeedNeedsRefresh() {
        uint32_t now = millis();
        if (now - lastMiningFeedFetch < MINING_FEED_REFRESH_MS) return false;
        lastMiningFeedFetch = now;
        return true;
    }

    // A failed feed fetch shouldn't cost the whole refresh window — pull the
    // next attempt in to ~3 s so a transient TLS/memory hiccup self-heals fast.
    void retryMiningFeedSoon() {
        lastMiningFeedFetch = millis() - MINING_FEED_REFRESH_MS + 3000;
    }

    void updateTreasuryData(const TreasuryData& data) {
        latestTreasury = data;
        turboScreen.updateData(data);
    }

    void loadOhlcvChart(OhlcvCandle* candles, int count) {
        turboScreen.loadRealCandles(candles, count, turboGroupDays());
    }

    // Turbo chart timeframe (1D/1W/1M dropdown) → candle grouping for
    // fetchOhlcvHistory(). 12 monthly bars keep the GT daily fetch at 360 rows.
    int turboGroupDays() { return turboScreen.timeframeSel == 0 ? 1 : (turboScreen.timeframeSel == 1 ? 7 : 30); }
    int turboBars()      { return turboScreen.timeframeSel == 2 ? 12 : 26; }
    bool turboTfConsumeDirty() {
        if (!turboScreen.tfDirty) return false;
        turboScreen.tfDirty = false;
        return true;
    }

    // Retry hook for main.cpp: true once the debt chart has real data.
    bool debtHistLoaded() const { return _debtHistLoaded; }
    void retryDebtHistory() {
        static const int yearValues[] = {5, 10, 20, 30, 50, 75};
        reloadDebtHistory(yearValues[debtYearsRangeIndex % 6]);
    }

    // Live TUSD price from DexScreener/GeckoTerminal (independent of the
    // treasury service, which may be down / not deployed).
    void updateTusdPrice(double priceUsd) {
        turboScreen.updatePrice(priceUsd);
    }

    void updateDebtData(const DebtData& data) {
        latestDebt = data;
        debtScreen.updateLiveTotal(data.totalDebtUsd);
        // Load the historical chart + SINCE/RATE once, on the first live total.
        if (!_debtHistLoaded) {
            static const int yearValues[] = {5, 10, 20, 30, 50, 75};
            reloadDebtHistory(yearValues[debtYearsRangeIndex % 6]);
        }
    }

    void updateLeaderboard(LeaderboardEntry* entries, int count) {
        nodeScreen.updateLeaderboard(entries, count);
        // The footers' "| N NODES" counter feeds off the same directory data
        // (it used to sit at 0 forever — nothing ever set it).
        int online = 0;
        for (int i = 0; i < count; i++) if (entries[i].online) online++;
        _onlineNodeCount = online;
    }

    void updateMiningFeed(MiningFeedEntry* entries, int count) {
        nodeScreen.updateMiningFeed(entries, count);
        // Remember when the countdown started, for the per-second ring/strip:
        // preferred = the pending block's created_at; fallback (same rule the
        // web uses, and what keeps this working if the DB view lacks
        // created_at) = the newest mined block's mined_at.
        time_t newestMined = 0;
        for (int i = 0; i < count; i++) {
            if (entries[i].mined && entries[i].minedAtUtc > newestMined)
                newestMined = entries[i].minedAtUtc;
            if (!entries[i].mined) {
                if (entries[i].createdAtUtc > 0) _pendingBlockCreatedAt = entries[i].createdAtUtc;
                _pendingBlockReward = entries[i].rewardTusd > 0 ? entries[i].rewardTusd : 100.0;
            }
        }
        if (_pendingBlockCreatedAt == 0 && newestMined > 0)
            _pendingBlockCreatedAt = newestMined;
    }

    // Called from the main loop after a successful RP2040 sensor poll. The new
    // values appear on the next per-second header/Home refresh, so there's no
    // need to redraw here.
    void updateAmbient(float tempC, int humidityPct) {
        _tempC = tempC;
        _humidityPct = humidityPct;
        _sensorValid = true;
    }

    // Called when a sensor poll fails (link down, or no AHT20 plugged in).
    // Drops back to showing "--" rather than a stale reading.
    void markAmbientUnavailable() {
        _sensorValid = false;
    }

    void showAlarmFiringOverlay() {
        lv_obj_t* overlay = lv_obj_create(lv_scr_act());
        lv_obj_set_size(overlay, LV_PCT(100), LV_PCT(100));
        lv_obj_set_style_bg_color(overlay, lv_color_hex(0xe8b339), 0);
        lv_obj_center(overlay);

        lv_obj_t* stopBtn = lv_btn_create(overlay);
        lv_obj_set_size(stopBtn, 160, 60);
        lv_obj_center(stopBtn);
        lv_obj_add_event_cb(stopBtn, [](lv_event_t* e) {
            UiManager* self = (UiManager*)lv_event_get_user_data(e);
            self->dismissAlarmOverlay();
        }, LV_EVENT_CLICKED, this);
        lv_obj_t* stopLabel = lv_label_create(stopBtn);
        lv_label_set_text(stopLabel, "STOP");
        lv_obj_center(stopLabel);

        alarmOverlay = overlay;
    }

    std::function<void()> onAlarmDismissed;

    // True while the yellow "alarm firing" overlay is up (i.e. the user hasn't
    // tapped STOP yet). main.cpp uses this to periodically re-send PLAY_ALARM
    // to the RP2040, so one lost UART frame can't result in a silent alarm.
    bool isAlarmOverlayActive() const { return alarmOverlay != nullptr; }

    // Public entry point for the physical top button: stop the ringing alarm
    // exactly like tapping the on-screen STOP.
    void stopRingingAlarm() { dismissAlarmOverlay(); }

    // Called from the touch input driver whenever the screen is physically touched.
    // Resets the inactivity timer and wakes the backlight if it was off.
    void _onTouchActivity() {
        _lastTouchMs  = millis();
        if (!_screenIsOn) {
            _screenIsOn = true;
            applyStoredBrightness();
        }
    }

    // Checked every loop() tick. Turns off the backlight after the configured
    // idle period when always-on mode is disabled.
    void _checkScreenTimeout() {
        if (storage.getScreenAlwaysOn()) return;
        uint32_t timeoutMs = (uint32_t)storage.getScreenTimeoutMins() * 60UL * 1000UL;
        if (_screenIsOn && (millis() - _lastTouchMs > timeoutMs)) {
            _screenIsOn = false;
            ledcWrite(0, 0);  // channel 0 = backlight
        }
    }

