TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        static lv_disp_drv_t dispDrv;
        lv_disp_drv_init(&dispDrv);
        dispDrv.hor_res   = LCD_H_RES;
        dispDrv.ver_res   = LCD_V_RES;
        dispDrv.draw_buf  = &drawBuf;
        dispDrv.user_data = _lcdPanel;
        dispDrv.flush_cb  = [](lv_disp_drv_t* drv, const lv_area_t* area, lv_color_t* colorP) {
            esp_lcd_panel_handle_t panel = static_cast<esp_lcd_panel_handle_t>(drv->user_data);
            esp_lcd_panel_draw_bitmap(panel,
                area->x1, area->y1,
                area->x2 + 1, area->y2 + 1,
                colorP);
            lv_disp_flush_ready(drv);
        };
        lv_disp_drv_register(&dispDrv);

        // 10. Register LVGL touch input driver (FT6336U, polled — no INT pin).
        //     Reads 5 bytes from I2C 0x48: [touch_count, xH, xL, yH, yL].
        //     D/CX bits in xH[7:6] and yH[7:4] are masked out.
        //     If colors look mirrored, swap x/y or invert here to match the
        //     physical orientation (portrait, connector at bottom).
        static lv_indev_drv_t indevDrv;
        lv_indev_drv_init(&indevDrv);
        indevDrv.type      = LV_INDEV_TYPE_POINTER;
        indevDrv.user_data = this;   // so the lambda can reach _onTouchActivity()
        indevDrv.read_cb   = [](lv_indev_drv_t* drv, lv_indev_data_t* data) {
            Wire.beginTransmission(TOUCH_I2C_ADDR);
            Wire.write(0x02);  // TD_STATUS register: number of touch points
            Wire.endTransmission(false);
            Wire.requestFrom((uint8_t)TOUCH_I2C_ADDR, (uint8_t)5);
            if (Wire.available() >= 5) {
                uint8_t pts = Wire.read() & 0x0F;
                uint8_t xh  = Wire.read() & 0x0F;
                uint8_t xl  = Wire.read();
                uint8_t yh  = Wire.read() & 0x0F;
                uint8_t yl  = Wire.read();
                if (pts > 0) {
                    // The FT6336U is mounted rotated 180° vs the panel: touches
                    // landed at the diagonally-opposite point (tapping the top-left
                    // date opened the bottom-right gear's popup, etc.). Mirror BOTH
                    // X and Y so taps hit their targets and swipes go the right way.
                    lv_coord_t rawX = (lv_coord_t)((xh << 8) | xl);
                    lv_coord_t rawY = (lv_coord_t)((yh << 8) | yl);
                    data->point.x = (LCD_H_RES - 1) - rawX;
                    data->point.y = (LCD_V_RES - 1) - rawY;
                    data->state   = LV_INDEV_STATE_PRESSED;
                    // Any touch resets the inactivity timer (and wakes screen if off)
                    static_cast<UiManager*>(drv->user_data)->_onTouchActivity();
                } else {
                    data->state = LV_INDEV_STATE_RELEASED;
                }
            } else {
                data->state = LV_INDEV_STATE_RELEASED;
            }
        };
        lv_indev_drv_register(&indevDrv);

        // 11. Enable backlight via LEDC PWM (GPIO 45, active HIGH).
        //     5 kHz / 8-bit resolution gives smooth dimming with no audible whine.
        //     Arduino-ESP32 2.x API: ledcSetup(ch,freq,bits) + ledcAttachPin(pin,ch).
        //     Channel 0 is reserved for the backlight (LCD_BL_LEDC_CH = 0).
        ledcSetup(0, 5000, 8);
        ledcAttachPin(LCD_PIN_BL, 0);
        applyStoredBrightness();
    }

    void dismissAlarmOverlay() {
        if (alarmOverlay) { lv_obj_del(alarmOverlay); alarmOverlay = nullptr; }
        if (onAlarmDismissed) onAlarmDismissed();
    }

    void buildAllScreens() {
        screens[(int)ScreenId::CLOCK] = buildClockScreen();

        screens[(int)ScreenId::TURBO_STATS] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::TURBO_STATS], lv_color_black(), 0);
        turboScreen.build(screens[(int)ScreenId::TURBO_STATS], onLogoTapped, onDateTapped, onQrTapped, this);
        _wireAlarmIcon(turboScreen.header);

        screens[(int)ScreenId::DEBT] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::DEBT], lv_color_black(), 0);
        debtScreen.build(screens[(int)ScreenId::DEBT], onLogoTapped, onDateTapped, onQrTapped,
                          onDebtRangeTapped, onSinceBtnTapped, onRateBtnTapped, this);
        _wireAlarmIcon(debtScreen.header);

        screens[(int)ScreenId::INFLATION_GAME] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::INFLATION_GAME], lv_color_black(), 0);
        gameScreen.build(screens[(int)ScreenId::INFLATION_GAME], onLogoTapped, onDateTapped, onQrTapped, onGameYearsTapped, this);
        _wireAlarmIcon(gameScreen.header);

        screens[(int)ScreenId::NODE_NETWORK] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::NODE_NETWORK], lv_color_black(), 0);
        nodeScreen.build(screens[(int)ScreenId::NODE_NETWORK], onLogoTapped, onDateTapped, onQrTapped, onVerifyBadgeTapped, this);
        _wireAlarmIcon(nodeScreen.header);

        screens[(int)ScreenId::NFT] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::NFT], lv_color_black(), 0);
        nftScreen.build(screens[(int)ScreenId::NFT], onLogoTapped, onDateTapped, onQrTapped, this);
        _wireAlarmIcon(nftScreen.header);

        screens[(int)ScreenId::TICKERS] = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(screens[(int)ScreenId::TICKERS], lv_color_black(), 0);
        tickerScreen.build(screens[(int)ScreenId::TICKERS], onLogoTapped, onDateTapped, onQrTapped, this);
        _wireAlarmIcon(tickerScreen.header);
        TickerScreen::s_instance = &tickerScreen;
        lv_timer_create(TickerScreen::pollPending, 100, &tickerScreen);

        attachSwipeGesture(screens[(int)ScreenId::CLOCK]);
        attachSwipeGesture(screens[(int)ScreenId::TURBO_STATS]);
        attachSwipeGesture(screens[(int)ScreenId::DEBT]);
        attachSwipeGesture(screens[(int)ScreenId::INFLATION_GAME]);
        attachSwipeGesture(screens[(int)ScreenId::NODE_NETWORK]);
        attachSwipeGesture(screens[(int)ScreenId::NFT]);
        attachSwipeGesture(screens[(int)ScreenId::TICKERS]);
    }

    // Wire the alarm bell icon on a non-clock header after build().
    void _wireAlarmIcon(SharedHeaderRefs& hdr) {
        if (!hdr.alarmIcon) return;
        lv_obj_add_flag(hdr.alarmIcon, LV_OBJ_FLAG_CLICKABLE);
        lv_obj_set_ext_click_area(hdr.alarmIcon, 6);
        lv_obj_add_event_cb(hdr.alarmIcon, onAlarmIconTapped, LV_EVENT_CLICKED, this);
    }

    lv_obj_t* buildClockScreen() {
        lv_obj_t* scr = lv_obj_create(nullptr);
        lv_obj_set_style_bg_color(scr, lv_color_black(), 0);

