TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        // Real mining countdown (pending block opened_at + 1 h), once per tick.
        if (_pendingBlockCreatedAt > 0) {
            time_t nowUtc = time(nullptr);
            if (nowUtc > 1600000000) {   // only once NTP has synced
                long secsLeft = (long)(_pendingBlockCreatedAt + 3600 - nowUtc);
                nodeScreen.updateCountdown(secsLeft, _pendingBlockReward);
            }
        }

        // Node & Network headline (name, badge, rewards hint, uptime) — the
        // identity fields sync down from the backend on each heartbeat (see
        // applyServerConfig); uptime counts from boot. Refresh every 30 s.
        static uint32_t lastNodeStatusAt = 0;
        if (lastNodeStatusAt == 0 || millis() - lastNodeStatusAt > 30000) {
            lastNodeStatusAt = millis();
            String nm = storage.getDisplayName();
            if (nm.length() == 0) nm = "NODE " + storage.getNodeCode();
            nodeScreen.setNodeName(nm);
            bool ver = storage.getIsVerified();
            nodeScreen.setVerified(ver);
            nodeScreen.setRewards(ver, storage.getTotalEarned());
            uint32_t secs = millis() / 1000;
            char ub[20];
            if      (secs < 3600)  snprintf(ub, sizeof(ub), "%lum", (unsigned long)(secs / 60));
            else if (secs < 86400) snprintf(ub, sizeof(ub), "%luh %lum",
                                            (unsigned long)(secs / 3600), (unsigned long)((secs % 3600) / 60));
            else                   snprintf(ub, sizeof(ub), "%lud %luh",
                                            (unsigned long)(secs / 86400), (unsigned long)((secs % 86400) / 3600));
            nodeScreen.setUptime(ub);
        }

        // Clock/Home screen text only below
        if (currentScreen != ScreenId::CLOCK) return;

        // Home ambient line, e.g. "23° · 48%" (or "--° · --%" with no sensor).
        if (clockWeatherLabel) {
            char wBuf[24];
            if (_sensorValid) {
                float dT = (tempUnit == 'F') ? (_tempC * 9.0f / 5.0f + 32.0f) : _tempC;
                snprintf(wBuf, sizeof(wBuf), "%d\xC2\xB0 \xE2\x80\xA2 %d%%", (int)roundf(dT), _humidityPct);
            } else {
                snprintf(wBuf, sizeof(wBuf), "--\xC2\xB0 \xE2\x80\xA2 --%%");
            }
            lv_label_set_text(clockWeatherLabel, wBuf);
        }

        char timeBuf[12];
        if (is24h) snprintf(timeBuf, sizeof(timeBuf), "%02d:%02d", t.tm_hour, t.tm_min);
        else {
            int hour12 = t.tm_hour % 12; if (hour12 == 0) hour12 = 12;
            snprintf(timeBuf, sizeof(timeBuf), "%d:%02d %s", hour12, t.tm_min, t.tm_hour < 12 ? "AM" : "PM");
        }
        lv_label_set_text(clockTimeLabel, timeBuf);

        char dateBuf[24];
        const char* days[] = {"SUN","MON","TUE","WED","THU","FRI","SAT"};
        if (storage.getDateFormat() == "DD/MM")
            snprintf(dateBuf, sizeof(dateBuf), "%s %02d.%02d.%04d", days[t.tm_wday], t.tm_mday, t.tm_mon+1, t.tm_year+1900);
        else
            snprintf(dateBuf, sizeof(dateBuf), "%s %02d.%02d.%04d", days[t.tm_wday], t.tm_mon+1, t.tm_mday, t.tm_year+1900);
        lv_label_set_text(clockDateLabel, dateBuf);

        // Alarm pill: ALWAYS show the configured (or default) alarm time so the
        // user can see it at a glance. Yellow (border + icon + text) when the
        // alarm is enabled, grey when it's off — the time stays visible either way.
        char alarmBuf[28];
        lv_color_t alarmCol = alarmOn ? lv_color_hex(0xe8b339)   // yellow = on
                                      : lv_color_hex(0x6e7280);  // grey   = off
        snprintf(alarmBuf, sizeof(alarmBuf), "\xEF\x83\xB3 %02d:%02d",
                 storage.getAlarmHour(), storage.getAlarmMinute());
        lv_label_set_text(clockAlarmLabel, alarmBuf);
        lv_obj_set_style_text_color(clockAlarmLabel, alarmCol, 0);
        lv_obj_set_style_border_color(clockAlarmLabel, alarmCol, 0);
    }

    static void onOtaBadgeTapped(lv_event_t* e) {
        UiManager* self = (UiManager*)lv_event_get_user_data(e);
        const char* version = (const char*)lv_obj_get_user_data(lv_event_get_current_target(e));

        lv_obj_t* card = openModal(lv_layer_top());
        lv_obj_t* title = lv_label_create(card);
        char titleText[32]; snprintf(titleText, sizeof(titleText), "UPDATE TO %s", version ? version : "NEW VERSION");
        lv_label_set_text(title, titleText);
        lv_obj_set_style_text_color(title, lv_color_hex(0x3aff7a), 0);

        lv_obj_t* body = lv_label_create(card);
        lv_label_set_long_mode(body, LV_LABEL_LONG_WRAP);
        lv_obj_set_width(body, 280);
        lv_label_set_text(body,
            "The new firmware will download and install automatically. "
            "Your device will restart once — takes about 30 seconds total. "
            "All your settings are preserved.");
        lv_obj_set_style_text_color(body, lv_color_hex(0x9a9a9e), 0);

        lv_obj_t* row = lv_obj_create(card);
        lv_obj_set_size(row, LV_PCT(100), LV_SIZE_CONTENT);
        lv_obj_set_flex_flow(row, LV_FLEX_FLOW_ROW);
        lv_obj_set_style_pad_column(row, 8, 0);
        lv_obj_set_style_bg_opa(row, LV_OPA_0, 0);
        lv_obj_set_style_border_width(row, 0, 0);

        lv_obj_t* cancelBtn = addModalButton(row, "LATER", false);
        lv_obj_t* installBtn = addModalButton(row, "INSTALL NOW", true);

        static lv_obj_t* sCard; sCard = card;
        static UiManager* sSelf; sSelf = self;

        lv_obj_add_event_cb(cancelBtn, [](lv_event_t*) {
            closeModal(sCard);
        }, LV_EVENT_CLICKED, nullptr);

        lv_obj_add_event_cb(installBtn, [](lv_event_t*) {
            closeModal(sCard);
            // Show a "Downloading..." label before handing off to main.cpp
            lv_obj_t* splash = lv_obj_create(lv_layer_top());
            lv_obj_set_size(splash, LV_PCT(100), LV_PCT(100));
            lv_obj_set_style_bg_color(splash, lv_color_hex(0x000000), 0);
            lv_obj_center(splash);
            lv_obj_t* dlLabel = lv_label_create(splash);
            lv_label_set_text(dlLabel, "Downloading update...\nDo not turn off.");
            lv_obj_set_style_text_color(dlLabel, lv_color_hex(0x3aff7a), 0);
            lv_obj_center(dlLabel);
            lv_timer_handler(); // force a redraw so the splash is visible
            if (sSelf->onOtaInstallConfirmed) sSelf->onOtaInstallConfirmed();
        }, LV_EVENT_CLICKED, nullptr);
    }

    static void onAlarmLabelTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openAlarmPicker(); }
    static void onAlarmIconTapped(lv_event_t* e)  { ((UiManager*)lv_event_get_user_data(e))->openAlarmPicker(); }
    static void onLogoTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->showScreen(ScreenId::CLOCK); }
    static void onDateTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openCalendarPopup(); }
    static void onQrTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openConfigPopup(); }
    static void onDebtRangeTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openDebtRangePicker(); }
    static void onSinceBtnTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openSincePeriodPicker(); }
    static void onRateBtnTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openRateUnitPicker(); }
    static void onGameYearsTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openGameYearsPicker(); }
    static void onVerifyBadgeTapped(lv_event_t* e) { ((UiManager*)lv_event_get_user_data(e))->openVerifyTooltip(); }

    void openAlarmPicker() {
        lv_obj_t* card = openModal(lv_scr_act());

        lv_obj_t* title = lv_label_create(card);
        lv_label_set_text(title, "SET ALARM");
        lv_obj_set_style_text_color(title, lv_color_hex(0x9a9a9e), 0);

        // ── Day-of-week selector strip ────────────────────────────────────────
        // Layout: 7 squares (32×32) with 4px gap, centred.
        // Display order follows the week-start setting (auto-set from geo-IP,
        // user-overridable): 0 = Sunday first, 1 = Monday first.
        // Storage bitmask: bit0=Mon, bit1=Tue, …, bit6=Sun (ISO).
        // dayOrder[display_pos] = bitmask_bit_index
        bool sunFirst = (storage.getWeekStart() == 0);

        // Display order of bitmask-bit indices
        static const uint8_t dayOrderMon[7] = { 0, 1, 2, 3, 4, 5, 6 }; // Mon…Sun
        static const uint8_t dayOrderSun[7] = { 6, 0, 1, 2, 3, 4, 5 }; // Sun Mon…Sat
        const uint8_t* dayOrder = sunFirst ? dayOrderSun : dayOrderMon;

