TurboUSD/Node/firmware-esp32/include/ui/ui_manager.h
        // ── Projection mode (1Y…100Y) ──
        if (_gameRtActive) {
            _gameRtActive = false;
            lv_chart_set_update_mode(c, LV_CHART_UPDATE_MODE_CIRCULAR);
            gameScreen.setRealtimeAxis(false, 0.0);
        }
        const int N = 24;
        lv_chart_set_point_count(c, N);

        double endV = 10000.0 * pow(1.0 / (1.0 + rate), (double)years);
        // Fit the Y axis to the curve (default 0..100 would clip $10,000 flat —
        // that's why the line/number never appeared).
        lv_coord_t lo = (lv_coord_t)(endV * 0.9);
        lv_chart_set_range(c, LV_CHART_AXIS_PRIMARY_Y, lo, 10000);
        for (int i = 0; i < N; i++) {
            double t = years * (double)i / (N - 1);
            double v = 10000.0 * pow(1.0 / (1.0 + rate), t);
            lv_chart_set_next_value(c, s, (lv_coord_t)v);
        }

        int dayCount = (int)(millis() / 86400000UL);
        gameScreen.updateProjection(dayCount, endV, years);
        gameScreen.setHorizonLabel(years);
    }

    void openGameYearsPicker() {
        static const char* options = "REAL TIME\n1Y\n3Y\n5Y\n10Y\n20Y\n30Y\n50Y\n75Y\n100Y";
        static const int yearOpts[10] = {0, 1, 3, 5, 10, 20, 30, 50, 75, 100};
        lv_obj_t* card = openModal(lv_scr_act());
        lv_obj_t* roller = addOptionPicker(card, options, gameYearsIndex);
        lv_obj_t* saveBtn = addModalButton(card, "SAVE", true);
        static lv_obj_t* sCard;   sCard = card;
        static UiManager* sSelf;  sSelf = this;
        // Live-apply (see note above openSincePeriodPicker).
        lv_obj_add_event_cb(roller, [](lv_event_t* e) {
            sSelf->gameYearsIndex = lv_roller_get_selected(lv_event_get_target(e));
            int yrs = yearOpts[sSelf->gameYearsIndex % 10];
            char lbl[16];
            if (yrs == 0) snprintf(lbl, sizeof(lbl), "REAL TIME \xEF\x81\xB8");
            else          snprintf(lbl, sizeof(lbl), "%dY \xEF\x81\xB8", yrs);
            sSelf->gameScreen.setYearsButtonLabel(lbl);
            sSelf->_updateGameProjection();
        }, LV_EVENT_VALUE_CHANGED, nullptr);
        lv_obj_add_event_cb(saveBtn, [](lv_event_t*) { closeModal(sCard); }, LV_EVENT_CLICKED, nullptr);
    }

    // ── Real-time inflation tick (1/s while the game screen shows REAL TIME) ──
    // $10,000 eroded continuously at the derived annual debasement rate since
    // the node went online; the 4th decimal falls every few seconds.
    static const int GAME_RT_POINTS = 120;   // 2-minute rolling window
    void _tickGameRealtime() {
        lv_obj_t* c = gameScreen.getChart();
        lv_chart_series_t* s = gameScreen.getSeries();
        double rate     = _annualDebasementRate;
        double secsYear = 365.25 * 86400.0;
        double elapsed  = (double)millis() / 1000.0;
        double v        = 10000.0 * pow(1.0 / (1.0 + rate), elapsed / secsYear);
        double perSec   = v * log(1.0 + rate) / secsYear;   // $ lost per second

        if (_gameRtBaseline == 0.0) {
            _gameRtBaseline = v;
            gameScreen.setRealtimeAxis(true, _gameRtBaseline, false);
        }
        // Chart unit = 0.0001 $ offset from baseline (negative, falling).
        long scaledL = lround((v - _gameRtBaseline) * 10000.0);
        if (scaledL < -30000) {   // int16 lv_coord_t headroom — re-baseline
            _gameRtBaseline = v;
            _gameRtCount    = 0;
            gameScreen.setRealtimeAxis(true, _gameRtBaseline, false);
            lv_chart_set_all_value(c, s, LV_CHART_POINT_NONE);
            scaledL = 0;
        }
        lv_coord_t scaled = (lv_coord_t)scaledL;

        // Time flows left → right: FILL the window from the left edge first
        // (set_value_by_id), and only once it's full let the chart scroll
        // (set_next_value + SHIFT). The X labels flip from absolute
        // (0s → +2 min) to relative (-2 min → now) at that moment.
        if (_gameRtCount < GAME_RT_POINTS) {
            lv_chart_set_value_by_id(c, s, (uint16_t)_gameRtCount, scaled);
            _gameRtCount++;
            if (_gameRtCount == GAME_RT_POINTS)
                gameScreen.setRealtimeAxis(true, _gameRtBaseline, true);
        } else {
            lv_chart_set_next_value(c, s, scaled);
        }

        // Adaptive Y window: top = where this window's line STARTS (the
        // first point during the fill phase; the oldest visible point once
        // scrolling), bottom = current value MINUS 25% headroom. The line
        // always has fresh room to keep falling into — if the value plunged
        // while ticks were missed (screen off, blocking fetches), the span
        // simply grows and the whole curve stays in frame.
        lv_coord_t fallWin = (lv_coord_t)(perSec * 10000.0 * GAME_RT_POINTS) + 6;
        lv_coord_t hi = (_gameRtCount < GAME_RT_POINTS)
                        ? (lv_coord_t)3                    // fill phase: top = first point
                        : (lv_coord_t)(scaled + fallWin);  // scroll: oldest visible point
        lv_coord_t span = hi - scaled;
        if (span < 12) span = 12;
        lv_coord_t lo = scaled - (span / 4 + 2);           // 25% of the span free below
        lv_chart_set_range(c, LV_CHART_AXIS_PRIMARY_Y, lo, hi);

        int dayCount = (int)(millis() / 86400000UL);
        gameScreen.updateRealtime(dayCount, v, perSec);
    }

    void showScreen(ScreenId id, bool animate = true,
                    lv_scr_load_anim_t anim = LV_SCR_LOAD_ANIM_MOVE_LEFT) {
        currentScreen = id;
        // Update swipe position to stay in sync with direct navigation (e.g. logo tap → home)
        for (int i = 0; i < (int)ScreenId::COUNT; i++) {
            if (_swipeOrder[i] == (uint8_t)id) { _currentSwipePos = i; break; }
        }
        // Instant (non-animated) load for the very first screen at boot: a screen
        // animation that's still running when the provisioning screen loads can
        // corrupt LVGL and crash. Navigation taps/swipes still animate.
        //
        // Same protection for fast swiping: starting a second lv_scr_load_anim
        // while the previous 300 ms one is still running is a known LVGL 8
        // crash/corruption source (two screens animating, one gets unloaded
        // mid-anim). If the user swipes again before the animation finished,
        // load the next screen instantly instead of animating.
        static uint32_t lastAnimStartAt = 0;
        if (animate && millis() - lastAnimStartAt < 350) animate = false;
        if (animate) {
            lastAnimStartAt = millis();
            lv_scr_load_anim(screens[(int)id], anim, 300, 0, false);
        } else {
            lv_scr_load(screens[(int)id]);
        }
        // Trigger data load when ticker screen becomes visible
        if (id == ScreenId::TICKERS) {
            tickerScreen.onShow(storage.getNodeCode().c_str());
        }
        // Trigger NFT load (wallet prompt or cache refresh) when NFT screen shown
        if (id == ScreenId::NFT) {
            nftScreen.onShow();
        }
        // Refresh the inflation-game projection each time it's shown (uses the
        // latest debasement rate + selected horizon).
        if (id == ScreenId::INFLATION_GAME) {
            _updateGameProjection();
        }
    }

    void attachSwipeGesture(lv_obj_t* screen) {
        lv_obj_set_user_data(screen, this);
        // A scrollable screen swallows horizontal drags as (dead-end) scrolling,
        // which made only one swipe direction register. The content fits 480×480,
        // so the screen itself never needs to scroll — clearing the flag lets both
        // left and right swipes reliably fire the gesture.
        lv_obj_clear_flag(screen, LV_OBJ_FLAG_SCROLLABLE);
        lv_obj_add_event_cb(screen, [](lv_event_t* e) {
            lv_obj_t* target = lv_event_get_current_target(e);
            UiManager* self = (UiManager*)lv_obj_get_user_data(target);
            if (!self) return;
            lv_dir_t dir = lv_indev_get_gesture_dir(lv_indev_get_act());
            int count = (int)ScreenId::COUNT;
            // Swipe LEFT → next screen (slides in from the right);
            // Swipe RIGHT → previous screen (slides in from the left).
            // (Touch X is mirror-corrected in the read_cb, so the gesture
            // direction is now the natural one.)
            if (dir == LV_DIR_LEFT) {
                int newPos = (self->_currentSwipePos + 1) % count;
                self->showScreen((ScreenId)self->_swipeOrder[newPos], true, LV_SCR_LOAD_ANIM_MOVE_LEFT);
            } else if (dir == LV_DIR_RIGHT) {
                int newPos = (self->_currentSwipePos - 1 + count) % count;
                self->showScreen((ScreenId)self->_swipeOrder[newPos], true, LV_SCR_LOAD_ANIM_MOVE_RIGHT);
            }
        }, LV_EVENT_GESTURE, nullptr);
    }
};
